Спецификация программы:
1. Название модуля: MatrixColumnRemoval

2. Назначение модуля:
   - Удаление k-го столбца из вещественной матрицы размерности n * m.

3. Входные данные:
   - Двумерный массив double[,] matrix - вещественная матрица размерности n * m.
```
     Random rnd = new Random();
Console.WriteLine("Ввести количество строк: ");
int n = int.Parse(Console.ReadLine());
Console.WriteLine("Ввести количество столбцов: ");
int m = int.Parse(Console.ReadLine());
```
   - Элементы матрицы.
```
double[,] matrix = new double[n, m];
Console.WriteLine("Ввести элементы матрицы: ");
for (int i = 0; i < n; i++)
{
    for (int j = 0; j < m; j++)
    {
        matrix[i, j] = rnd.NextDouble() * 10;
        Console.Write(matrix[i, j]);
        Console.Write(" ");

    }
    Console.WriteLine();
}
```
   - Целое число colDelet - номер столбца, который необходимо удалить (нумерация начинается с 0).
```
 Console.Write("Ввсести номер столбца для удаления: ");
 int colDelet = int.Parse(Console.ReadLine()) - 1;
 double[,] newMatrix = new double[n, m];
 for (int i = 0; i < n; i++)
 {
     for (int j = 0; j < m; j++)
     {
         if (j != colDelet)
         {
             newMatrix[i, j] = matrix[i, j];
         }
         else
         {
             newMatrix[i, j] = 0;
         }
     }
 }
```

4. Выходные данные:
   - Новый двумерный массив double[,] newMatrix - вещественная матрица размерности n * (m-1), полученная после удаления k-го столбца из матрицы matrix.
```
Console.WriteLine("Новая матрица: ");
for (int i = 0; i < n; i++)
{
    for (int j = 0; j < m; j++)
    {
        Console.Write(newMatrix[i, j] + " ");
    }
    Console.WriteLine();
}
```

5. Предусловия:
   - Матрица matrix должна быть вещественной.
   - Размерность матрицы matrix должна быть n * m, где n и m - целые положительные числа.
   - Номер столбца colDelet должен быть в диапазоне от 0 до m-1.

6. Постусловия:
   - Размерность новой матрицы newMatrix должна быть n * (m-1).
   - Все элементы матрицы newMatrix должны соответствовать элементам исходной матрицы matrix, за исключением элементов colDelt-го столбца.

7. Алгоритм:
   1. Проверить, что входные данные удовлетворяют предусловиям.
   2. Создать новую матрицу newMatrix размерности n * (m-1).
   3. Скопировать элементы из матрицы matrix в матрицу newMatrix, пропуская colDelt-й столбец.
   4. Вернуть матрицу newMatrix в качестве результата.
8. Пример работы:
   Ввести количество строк:
    2
   Ввести количество столбцов:
    2
   Ввести элементы матрицы:
    3,973898527093296 4,880859399974674
    6,109754061353382 1,1791601811861696
   Ввсести номер столбца для удаления: 2
   Новая матрица:
    3,973898527093296 0
    6,109754061353382 0
